app/controllers/ages_controller.rb

 def problems

   @posts = Age.paginate(:page => params[:page], :per_page => 5)
---
SELECT "ages".* FROM "ages"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "ages"

 def show
 @post = Age.find(params[:id])
---
SELECT  "ages".* FROM "ages" WHERE "ages"."id" = ? LIMIT 1  [["id", 1]]

 def create
 @post = Age.new(post_params)
 if@post.save
---
INSERT INTO "ages" ("question", "solution", "optionA", "optionB", "optionC", "optionD", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

 def edit
 @post = Age.find(params[:id])
---
SELECT  "ages".* FROM "ages" WHERE "ages"."id" = ? LIMIT 1  [["id", 2]]

 def update
 @post = Age.find(params[:id])
 if @post.update(params[:age].permit(:question, :solution, :optionA, :optionB, :optionC, :optionD, :answer))
---
SELECT  "ages".* FROM "ages" WHERE "ages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "ages" SET "question" = ?, "solution" = ?, "updated_at" = ? WHERE "ages"."id" = ?  [["question", "<p>Question2</p>"], ["solution", "<p>X<sup>2 </sup>- 1 =0</p>"], ["updated_at", "2016-06-07 10:10:40.152156"], ["id", 2]]

 def destroy
 @post = Age.find(params[:id])
 @post.destroy
---
SELECT  "ages".* FROM "ages" WHERE "ages"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "ages" WHERE "ages"."id" = ?  [["id", 1]]