app/controllers/areas_controller.rb

 def problems

   @posts = Area.paginate(:page => params[:page], :per_page => 2)
---
SELECT  "areas".* FROM "areas" LIMIT 2 OFFSET 0

 def show
 @post = Area.find(params[:id])
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", 1]]

 def create
 @post = Area.new(post_params)
 if@post.save
---
INSERT INTO "areas" ("question", "solution", "optionA", "optionB", "optionC", "optionD", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

 def edit
 @post = Area.find(params[:id])
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", 1]]

 def update
 @post = Area.find(params[:id])
 if @post.update(params[:area].permit(:question, :solution, :optionA, :optionB, :optionC, :optionD, :answer))
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "areas" SET "solution" = ?, "updated_at" = ? WHERE "areas"."id" = ?  [["solution", "Area 23"], ["updated_at", "2016-06-03 10:10:09.366288"], ["id", 1]]

 def destroy
 @post = Area.find(params[:id])
 @post.destroy
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "areas" WHERE "areas"."id" = ?  [["id", 1]]