app/controllers/bankersdiscounts_controller.rb

 def problems
add_breadcrumb "problem", bankersdiscounts_problems_url

   @posts = Bankersdiscount.paginate(:page => params[:page], :per_page => 2)
---
SELECT  "bankersdiscounts".* FROM "bankersdiscounts" LIMIT 2 OFFSET 0

 def show
 @post = Bankersdiscount.find(params[:id])
---
SELECT  "bankersdiscounts".* FROM "bankersdiscounts" WHERE "bankersdiscounts"."id" = ? LIMIT 1  [["id", 1]]

 def create
 @post = Bankersdiscount.new(post_params)
 if@post.save
---
INSERT INTO "bankersdiscounts" ("question", "solution", "optionA", "optionB", "optionC", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)