app/controllers/clocks_controller.rb

SELECT  "clocks".* FROM "clocks" LIMIT 2 OFFSET 0
---
 def problems

add_breadcrumb "problem", clocks_problems_url
   @posts = Clock.paginate(:page => params[:page], :per_page => 2)

SELECT  "clocks".* FROM "clocks" WHERE "clocks"."id" = ? LIMIT 1  [["id", 1]]
---
 def show
 @post = Clock.find(params[:id])

INSERT INTO "clocks" ("question", "solution", "optionA", "optionB", "optionC", "optionD", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
 def create
 @post = Clock.new(post_params)
 if@post.save