app/controllers/compoundinterests_controller.rb

 def problems

   @posts = Compoundinterest.paginate(:page => params[:page], :per_page => 2)
---
SELECT  "compoundinterests".* FROM "compoundinterests" LIMIT 2 OFFSET 0