app/controllers/decimalfractions_controller.rb

 def problems

   @posts = Decimalfraction.paginate(:page => params[:page], :per_page => 2)
---
SELECT  "decimalfractions".* FROM "decimalfractions" LIMIT 2 OFFSET 0