app/controllers/permutationandcombinations_controller.rb

SELECT  "permutationandcombinations".* FROM "permutationandcombinations" LIMIT 2 OFFSET 0
---
 def problems

   @posts = Permutationandcombination.paginate(:page => params[:page], :per_page => 2)