app/controllers/probabilitys_controller.rb

SELECT  "probabilities".* FROM "probabilities" LIMIT 2 OFFSET 0
---
 def problems

   @posts = Probability.paginate(:page => params[:page], :per_page => 2)