app/controllers/racesandgames_controller.rb

 def problems

   @posts = Racesandgame.paginate(:page => params[:page], :per_page => 2)
---
SELECT  "racesandgames".* FROM "racesandgames" LIMIT 2 OFFSET 0

 def show
 @post = Racesandgame.find(params[:id])
---
SELECT  "racesandgames".* FROM "racesandgames" WHERE "racesandgames"."id" = ? LIMIT 1  [["id", 1]]

 def create
 @post = Racesandgame.new(post_params)
 if@post.save
---
INSERT INTO "racesandgames" ("question", "solution", "optionA", "optionB", "optionC", "optionD", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)