app/controllers/squareandcuberoots_controller.rb

SELECT  "squareandcuberoots".* FROM "squareandcuberoots" LIMIT 2 OFFSET 0
---
 def problems

   @posts = Squareandcuberoot.paginate(:page => params[:page], :per_page => 2)